Repository: animesht/isitfedoraruby
Catalog: locale/*/app.po
Languages: uk

source: This is the home page for the Is It Fedora Ruby web application
uk: Це домашня сторінка вебпрограми Is It Fedora Ruby

source: *new* <a href=/stats/gemfile_tool>compare</a> your Gemfile against Fedora
uk: *нове* <a href=/stats/gemfile_tool>порівняння</a> вашого файла Gem з файлом у Fedora

source: Version
uk: Версія

source: Rpm Version
uk: Версія RPM

source: Downloads
uk: Звантаження

source: Upstream
uk: На сайті розробників

source: Git commits
uk: Внески Git

source: Commits
uk: Внески

source: Updated
uk: Оновлено

source: Wanted by
uk: Потрібен

source: Most wanted gems
uk: Найпотрібніші gem

source: Most popular rpms
uk: Найпопулярніші RPM

source: Most recent rpms
uk: Найсвіжіші RPM

source: Most popular gems
uk: Найпопулярніші gem

source: Is It Fedora Ruby on Github
uk: Is It Fedora Ruby на Github

source: About
uk: Про програму

source: Contact
uk: Зв'язок

source: Home
uk: Домівка

source: Ruby Gems
uk: Gem-и Ruby

source: Fedora Rpms
uk: Пакунки RPM Fedora

source: Success Stories
uk: Історії успіху

source: Find some of the best-known success stories here!
uk: Тут ви можете знайти деякі з найвідоміших історій успішного користування службою!

source: Contribute
uk: Взяти участь у розробці

source: Search
uk: Пошук

source: All Fedora Rpms
uk: Всі RPM Fedora

source: Name
uk: Назва

source: Up to date?
uk: Найновіший?

source: Git Commits
uk: Внески Git

source: Last Commit
uk: Останній внесок

source: Patched?
uk: Латаний?

source: Maintainer
uk: Супровідник

source: Yes
uk: Так

source: No
uk: Ні

source: %{time_ago} ago
uk: %{time_ago} тому

source: Homepage URI
uk: Адреса домашньої сторінки

source: Source Code URI
uk: Адреса сторінки коду

source: Dependency Tree
uk: Ієрархія залежностейййййй

source: Hotness: %{rpm_hotness}%
uk: Важливість: %{rpm_hotness}%

source: Up to date:
uk: Найновіший:

source: Maintainer: %{maintainer_email}
uk: Супровідник: %{maintainer_email}

source: Versions: %{rpm_versions}
uk: Версії: %{rpm_versions}

source: Git Commits: %{rpm_commits}
uk: Внески Git: %{rpm_commits}

source: Depends on:
uk: Залежить від:

source: Package
uk: Пакунок

source: Gem Version
uk: Версія Gem

source: Bugs:
uk: Вади:

source: Title
uk: Заголовок

source: Review?
uk: Рецензування?

source: Builds:
uk: Збірки:

source: Build ID
uk: Ід. збирання

source: Dependent Packages:
uk: Залежні пакунки:

source: All Fedora Rpms maintained by %{name}
uk: Всі пакунки RPM, які супроводжує %{name}

source: See it in a nice bubble chart
uk: Показати у форматі бульбашкової діаграми

source: Gem / Fedora Version
uk: Версія у Gem / Fedora

source: Bubble Chart:
uk: Бульбашкова діаграма:

source: This graph shows the packages, which are represented by circles, that the user %{user_name} owns.
uk: На цьому графіку колами показано пакунки, супровід яких здійснює користувач %{user_name}.

source: The size of each circle is proportional to the number of commits for that package.
uk: Радіус кожного з кіл пропорційний до кількості внесків у цей пакунок.

source: Back
uk: Назад

source: Test your Gemfile or Gemfile.lock against Fedora
uk: Перевірте відповідність вашого Gemfile або Gemfile.lock щодо Fedora

source: Upload it
uk: Вивантажте

source: or Paste it
uk: або вставте

source: upload
uk: вивантажити

source: submit
uk: надіслати

source: All Ruby Gems
uk: Всі Gem-и Ruby

source: Fedora Rpm
uk: RPM Fedora

source: Wantedness: %{gem_wantedness}
uk: Потрібність: %{gem_wantedness}

source: Version: %{gem_version}
uk: Версія: %{gem_version}

source: Total Downloads: %{total_downloads_number}
uk: Загалом звантажень: %{total_downloads_number}

source: Description:
uk: Опис:

source: %{gem_name} does not have a description yet
uk: %{gem_name} ще не має опису

source: Comments
uk: Коментарі

source: Name: %{comment_name}
uk: Назва: %{comment_name}

source: Email: %{comment_email}
uk: Ел. пошта: %{comment_email}

source: Comment:
uk: Коментар:

source: Email
uk: Ел. пошта

source: Add new comment
uk: Додати новий коментар

source: Yes I want it!
uk: Так, він мені потрібен!

source: Keep me updated!
uk: Повідомляти про оновлення!

source: Submit
uk: Надіслати

source: RubyGems -> RPMs
uk: RubyGem -> RPM

source: Dependencies:
uk: Залежності:

source: No dependencies
uk: Немає залежностей

source: build with koji
uk: зібрати за допомогою koji

source: Next
uk: Далі

source: Name of Gem to Import:
uk: Назва Gem для імпортування:

source: Select version of gem %{gem_name} to import
uk: Виберіть версію gem %{gem_name} для імпортування

source: IsItFedoraRuby is a web-application (a Rails application) for keeping track of the Fedora/Ruby integration, especially gem->rpm conversion, documentation, and success stories.
uk: IsItFedoraRuby — вебпрограма (програма Rails) для стеження за інтеграцією Fedora та Ruby, зокрема перетворенням gem->rpm, документування та оприлюднення історій успішного використання.

source: The project was started on 2012 as a <a href=https://fedoraproject.org/wiki/GSOC_2012/Student_Application_Zuhao/IsItFedoraRuby>Google Summer Of Code project</a> by Zuhao, and it is growing to include Ruby Special Interest Group.
uk: Роботу над проектом було розпочато у 2012 році у межах <a href=https://fedoraproject.org/wiki/GSOC_2012/Student_Application_Zuhao/IsItFedoraRuby>проекту Google Summer Of Code</a> розробником Zuhao. Згодом проект розрісся і його було включено до сфери інтересів Ruby Special Interest Group.

source: Ruby Special Interest Group
uk: Група за інтересами Ruby

source: A SIG for people who are interested in improving the state of Ruby in Fedora. This includes packaging Ruby libraries and applications, setting and improving standards for packaging them as RPMs and maintaining Ruby packages for Fedora.
uk: Ця група за інтересами об’єднує учасників спільноти, які зацікавлені у покращенні стану підтримки Ruby у Fedora. Це зокрема стосується пакування бібліотек та програм мовою Ruby, розробки та покращення стандартів пакування у форматі RPM та супроводу пакунків Ruby у Fedora.

source: Packaging Ruby libraries and applications for Fedora is an ongoing process. We hope that this situation will improve dramatically over the next few months; that means that you, dear reader, can become a hero by packaging your favorite piece of Ruby code as an RPM and submitting it to Fedora.
uk: Пакування бібліотек і програм мовою Ruby у Fedora все ще є доволі непростим процесом. Ми сподіваємося, що цю проблему буде усунуто протягом найближчих місяців. Тобто ви, шановний читачу, можете стати героєм пакування ваших улюблених компонентів коду мовою Ruby у форматі RPM та надання пакунків у розпорядження користувачів Fedora.

source: Please Contribute!
uk: Допоможіть у розробці!

source: As this project is still in its early stage, please feel free to contribute any code or ideas to make it better.
uk: Оскільки розробка цього проекту все ще перебуває на початковій стадії, ви можете допомогти з програмною частиною або висловити власні ідеї щодо покращення проекту.

source: For more info, please check out the <a href=http://github.com/zuhao/isitfedoraruby>code</a> or visit the <a href=https://fedoraproject.org/wiki/Ruby_SIG>Ruby SIG</a> wiki page.
uk: Щоб дізнатися більше, будь ласка, ознайомтеся з <a href=http://github.com/zuhao/isitfedoraruby>кодом</a> або відвідайте сторінку вікі <a href=https://fedoraproject.org/wiki/Ruby_SIG>Ruby SIG</a>.

source: Comment
uk: Коментар

source: It works for me!
uk: Це допомогло мені!

source: Contribute to make it better!
uk: Візьміть участь у проекті з метою його покращення!

source: Find how to contribute to the Fedora/Ruby community.
uk: Ознайомтеся з можливостями участі у спільноті Fedora/Ruby.

source: %{dep_name} (%{dep_version}) is too old in %{rv_fedora_version} (which has %{rv_rpm_version})
uk: %{dep_name} (%{dep_version}) у %{rv_fedora_version} є надто старим (має версію %{rv_rpm_version})

source: %{dep_name} (%{dep_version}) is sufficient in %{rv_fedora_version}
uk: %{dep_name} (%{dep_version}) у %{rv_fedora_version} має достатню версію

source: %{dep_name} is in Fedora!
uk: %{dep_name} є у Fedora!

source: %{dep_name} not found in Fedora
uk: %{dep_name} у Fedora не знайдено

source: Timeline (Bugs and Versions)
uk: Хронологічна діаграма (вади і версії)

source: This timeline depicts a chronological visualization of the bugs & version releases for %{gem_name}
uk: На цій діаграмі зображено хронологічний порядок випусків з виправленнями вад та новими версіями %{gem_name}
